import React from 'react';

/**
 * @description 기사의 퀴즈를 보여주는 컴포넌트
 * 
 * @todo [퀴즈 문제] 구현 필요
 * @todo [퀴즈 문제] 구현 방법: [3개의 퀴즈 문제 순차적 노출]
 * @todo [퀴즈 문제] 요구사항: [문제당 선지 제공 및 사용자 선택 기능]
 * 
 * @todo [정답 처리] 구현 필요
 * @todo [정답 처리] 구현 방법: [오답 선택시 정답 표시]
 * @todo [정답 처리] 요구사항: [전체 사용자의 선지별 선택 비율 표시]
 * 
 * @todo [퀴즈 해설] 구현 필요
 * @todo [퀴즈 해설] 구현 방법: [모든 문제 완료 후 해설 제공]
 * @todo [퀴즈 해설] 요구사항: [문제별 상세 해설 하단 표시]
 * 
 * @todo [네비게이션] 구현 필요
 * @todo [네비게이션] 구현 방법: [퀴즈 완료 후 이동 버튼 표시]
 * @todo [네비게이션] 요구사항: [기사로 돌아가기, 홈으로 가기 버튼 제공]
 */

const Quiz = () => {
    return (
        <div>
            Quiz component.
        </div>
    );
};

export default Quiz;
